# CommandId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CommandEventArgs..::..CommandId Property
CommandEventArgs Class See Also
---
The command id.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RevitCommandId CommandId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CommandId As RevitCommandId
	Get
```

Visual C++
---
```text
public:
property RevitCommandId^ CommandId {
	RevitCommandId^ get ();
}
```

# See Also
CommandEventArgs Class
Autodesk.Revit.UI.Events Namespace